{
  "CS_1110": {
    "description": "A first course in programming, software development, and computer science.  Introduces computing fundamentals and an appreciation for computational thinking.  No previous programming experience required.  Note: CS 1110, 1111, 1112, 1113, and 1120 provide different approaches to teaching the same core material; students may only receive credit for one of these courses. Students may not enroll if CS 2100 or CS 3140 has been completed.",
    "prerequisites": ""
  },
  "CS_1112": {
    "description": "A first course in programming, software development, and computer science.  Introduces computing fundamentals and an appreciation for computational thinking.",
    "prerequisites": "Students must have no previous programming experience.  Note: CS 1110, 1111, 1112, 1113, and 1120 provide different approaches to teaching the same core material; students may only receive credit for one of these courses. Students may not enroll if CS 2100 or CS 3140 has been completed."
  },
  "CS_1113": {
    "description": "A first course in programming, software development, and computer science.  Introduces computing fundamentals and an appreciation for computational thinking.  Special domain topics and materials will differ by section and semester.  Note: CS 1110, 1111, 1112, 1113, and 1120 provide different approaches to teaching the same core material; students may only receive credit for one of these courses. Students may not enroll if CS 2100 or CS 3140 has been completed.",
    "prerequisites": ""
  },
  "CS_2100": {
    "description": "A second course in computing with an emphasis on foundational data structures and program analysis. The course provides a introduction to object oriented programming and the Java programming language, concurrency, and inheritance / polymorphism. Additionally, foundational data structures and related algorithms / analysis are studied. These include lists, stacks, queues, trees, hash tables, and priority queues. Prereq: CS 1110 or CS 1111 or CS 1112 or CS 1113 or place out test for CS 1110 or CS 2100",
    "prerequisites": ""
  },
  "CS_2120": {
    "description": "Introduces discrete mathematics and proof techniques involving first order predicate logic and induction. Application areas include sets, tuples, functions, relations, and combinatorial problems. Prereq: Must have completed CS 1110 or CS 1111 or CS 1112 or CS 1113 with a grade of C- or better OR successfully completed the CS 1110 or CS 2100 place out test.",
    "prerequisites": ""
  },
  "CS_2130": {
    "description": "This course covers topics on the computer architecture abstraction hierarchy ranging from a step above silicon to a step below modern programming languages. Students in this course will learn to write low-level code in C and Assembly, how data is stored in memory, the basics of hardware design from gates and registers through general-purpose computers, and legal, ethical, and security issues related to these topics. CS 1100 - CS 1199 and either familiarity with Java, C++, or another C-like language, or concurrent enrollment in CS 2100",
    "prerequisites": ""
  },
  "CS_2501": {
    "description": "Content varies, depending on instructor interests and the needs of the Department.  Taught strictly at the undergraduate level.",
    "prerequisites": "Instructor permission; additional specific requirements vary with topics."
  },
  "CS_2910": {
    "description": "An overview of computer science education for undergraduate students. Topics include ethics, diversity, tutoring and teaching techniques, and classroom management. Students enrolled in this course serve as a teaching assistant for a computer science course as part of their coursework.",
    "prerequisites": ""
  },
  "CS_2993": {
    "description": "In-depth study of a computer science or computer engineering problem by an individual student in close consultation with departmental faculty.",
    "prerequisites": ""
  },
  "CS_3100": {
    "description": "Builds upon previous analysis of algorithms and the effects of data structures on them. Algorithms selected from areas such as searching, shortest paths, greedy algorithms, backtracking, divide-and-conquer, dynamic programming, and machine learning. Analysis techniques include asymptotic worst case, expected time, amortized analysis, and reductions.",
    "prerequisites": "CS 2100 & CS 2120. Background in topics covered in a first course in Calculus is required. CS 3140 is recommended."
  },
  "CS_3120": {
    "description": "The goal of this course is to understand the fundamental limits on what can be efficiently computed. These limits reveal properties about information, communication, and computing, as well as practical issues about how to solve problems. Introduces computation theory including grammars, automata, and Turing machines. Prereq: CS 3100 with a grade of C- or better",
    "prerequisites": ""
  },
  "CS_3130": {
    "description": "A second course in computer systems, this course will explore a more realistic model of processors and how they and the operating system work together to provide various functionality we depend on as application programmers. Course topics include permission models, system architecture, concurrency, virtual memory, cryptographic primitives, and TCP/IP networking. Prereq CS 2100 and CS 2130 with a grade of C- or better",
    "prerequisites": ""
  },
  "CS_3140": {
    "description": "A first course in software engineering and software construction, this course focuses on bringing the programming concepts learned in a first course in data structures and algorithms together to begin to teach students how to build more complex systems. The course covers introductory topics in testing, software design principles, design patterns, functional programming, and data storage and manipulation. Completed CS 2100 with a C- or better.",
    "prerequisites": ""
  },
  "CS_3205": {
    "description": "Human-computer interaction and user-centered design in the context of software engineering. Examines the fundamental principles of human-computer interaction. Includes evaluating a system's usability based on well-defined criteria; user and task analysis, as well as conceptual models and metaphors; the use of prototyping for evaluating design alternatives; and physical design of software user-interfaces, including windows, menus, and commands.",
    "prerequisites": "CS 2100 with a grade of C- or better OR successfully completed the CS 2100 place out test."
  },
  "CS_3240": {
    "description": "Analyzes modern software engineering practice for multi-person projects; methods for requirements specification, design, implementation, verification, and maintenance of large software systems; advanced software development techniques and large project management approaches; project planning, scheduling, resource management, configuration control, and documentation.",
    "prerequisites": "CS 3140 with a grade of C- or better"
  },
  "CS_3250": {
    "description": "An introduction to testing for assuring software quality. Covers concepts and techniques for testing software, including testing at the unit, module, subsystem, and system levels; automatic and manual techniques for generating and validating test data; the testing process; static vs. dynamic analysis; functional testing; inspections; testing in specific application domains; and reliability assessment.",
    "prerequisites": "CS 2100 and CS 2120 (OR CS 2100 place out test and CS 2120) with a grade of C- or better"
  },
  "CS_3501": {
    "description": "Content varies, depending on instructor interests and the needs of the Department.  Taught strictly at the undergraduate level.",
    "prerequisites": "Instructor permission; additional specific requirements vary with topics."
  },
  "CS_3710": {
    "description": "Introduces students to the fields of cybersecurity. Both non-technical issues, such as ethics and policy, and technical issues are covered. Students see and experiment with a wide range of areas within cybersecurity, including: binary exploitation, encryption, digital forensics, networks, and modern threats.",
    "prerequisites": "CS 2100 and CS 2130 or (CS 2100 place out test and CS 2130) with a grade of C- or better."
  },
  "CS_4330": {
    "description": "Provides an overview of modern microprocessor design. The topics covered in the course will include the design of super-scalar processors and their memory systems, and the fundamentals of multi-core processor design.",
    "prerequisites": "CS 3330 with a grade of C- or better"
  },
  "CS_4414": {
    "description": "Analyzes process communication and synchronization; resource management; virtual memory management algorithms; file systems; and networking and distributed systems.",
    "prerequisites": "CS 3330 or (CS 2501 COA 2 & CS 2150) or (CS 3130 and CS 3100) with a grade of C- or better or ECE 3430 or ECE 3502 Embedded Computing & Robotics 2"
  },
  "CS_4457": {
    "description": "A first course in communication networks for upper-level undergraduate students. Topics include the design of modern communication networks; point-to-point and broadcast network solutions; advanced issues such as Gigabit networks; ATM networks; and real-time communications. Cross-listed as ECE 4457.",
    "prerequisites": "CS 3330 or CS 2501 topic \"COA 2\" or ECE 3430 or ECE 4435 or ECE 3502 topic \"ECR II\" or CS 3130. Must complete CS courses with a grade of C- or better."
  },
  "CS_4501": {
    "description": "Content varies annually, depending on instructor interests and the needs of the department. Similar to CS 5501 and CS 7501, but taught strictly at the undergraduate level.",
    "prerequisites": "Instructor permission; additional specific requirements vary with topics."
  },
  "CS_4630": {
    "description": "Viruses, worms, and other malicious software are an ever-increasing threat to computer systems. There is an escalating battle between computer security specialists and the designers of malicious software. This course provides an essential understanding of the techniques used by both sides of the computer security battle.",
    "prerequisites": "CS 3710 with a grade of C- or better"
  },
  "CS_4640": {
    "description": "Presents programming languages and implementations used in developing web applications. Both client and server side languages are presented as well as database languages. In addition, frameworks that enable interactive web pages are discussed as well as formatting languages. Language features and efficiencies including scoping, parameter passing, object orientation, just in time compilation and dynamic binary translation are included.",
    "prerequisites": "CS 2150 or CS 3140 with a grade of C- or better"
  },
  "CS_4710": {
    "description": "Introduces artificial intelligence. Covers fundamental concepts and techniques and surveys selected application areas. Core material includes state space search, logic, and resolution theorem proving. Application areas may include expert systems, natural language understanding, planning, machine learning, or machine perception. Provides exposure to AI implementation methods, emphasizing programming in Common LISP.",
    "prerequisites": "CS 3100 with a grade of C- or better"
  },
  "CS_4720": {
    "description": "Mobile computing devices have become ubiquitous in our communities. In this course, we focus on the creation of mobile solutions for various modern platforms, including major mobile operating systems. Topics include mobile device architecture, programming languages, software engineering, user interface design, and app distribution.",
    "prerequisites": "CS 2150 or CS 3140 with a grade of C- or better"
  },
  "CS_4730": {
    "description": "This course will introduce students to the concepts and tools used in the development of modern 2-D and 3-D real-time interactive computer video games. Topics covered in this include graphics, parallel processing, human-computer interaction, networking, artificial intelligence, and software engineering.",
    "prerequisites": "CS 2150 or CS 3140 with a grade of C- or better"
  },
  "CS_4740": {
    "description": "Investigates the architectural foundations of the various cloud platforms, as well as examining both current cloud computing platforms and modern cloud research. Student assignments utilize the major cloud platforms.",
    "prerequisites": "CS 2150 or CS 3140 with a grade of C- or better"
  },
  "CS_4750": {
    "description": "Introduces the fundamental concepts for design and development of database systems. Emphasizes relational data model and conceptual schema design using ER model, practical issues in commercial database systems, database design using functional dependencies, and other data models. Develops a working relational database for a realistic application.",
    "prerequisites": "CS 2150 or (CS 2120 and 3140) with a grade of C- or better"
  },
  "CS_4760": {
    "description": "This course covers the principles of secure network communications and the application of network security. Topics include: attack types, attack surfaces, attack phases, network security devices.(a)symmetric key encryption, cryptographic hash function, authentication/identification techniques, key distribution, and data integrity assurance. Also, currently used security mechanisms and protocols will be discussed.",
    "prerequisites": "CS 3710 with a grade of C- or better"
  },
  "CS_4774": {
    "description": "An introduction to machine learning: the study of algorithms that improve their performance through experience. Covers both machine learning theory and algorithms. Introduces algorithms, theory, and applications related to both supervised and unsupervised learning, including regression, classification, and optimization and major algorithm families for each.",
    "prerequisites": "CS 2150 or CS 3100 with a grade of C- or better; APMA 3100, APMA 3110, MATH 3100, or equivalent and Math 3350 or APMA 3080 or equivalent"
  },
  "CS_4790": {
    "description": "This course is a general introduction to cryptocurrencies and blockchain applications.  Students will understand the theoretical concepts that underlay cryptocurrencies, and implement both their own cryptocurrencies as well as develop applications that run on existing cryptocurrencies. Students will see the ethics, legal, and policy aspects pertaining to the subject.",
    "prerequisites": "CS 3100 with a grade of C- or better"
  },
  "CS_4980": {
    "description": "This course is one option in the CS fourth-year thesis track. Students will seek out a faculty member as an advisor, and do an independent project with said advisor. Instructors can give the 3 credits across multiple semesters, if desired. This course is designed for students who are doing research, and want to use that research for their senior thesis. Note that this track could also be an implementation project, including a group-based project.",
    "prerequisites": "CS 3140 with a grade of C- or higher, and BSCS major."
  },
  "CS_4991": {
    "description": "Supports the writing of the technical report component of the fourth-year thesis, credit for which is given in STS 4600. Students will write the report assuming a non-technical audience. The course is part of the CS 4XXX elective option in the fourth-year CS thesis track. BS CS 4th years (both first & second majors) and pre- or co-requisite STS 4500",
    "prerequisites": ""
  },
  "CS_4993": {
    "description": "In-depth study of a computer science or computer engineering problem by an individual student in close consultation with departmental faculty. The study is often either a thorough analysis of an abstract computer science problem or the design, implementation, and analysis of a computer system (software or hardware).",
    "prerequisites": "Instructor permission."
  },
  "CS_4998": {
    "description": "Required for Distinguished Majors completing the Bachelor of Arts degree in the College of Arts and Sciences. An introduction to computer science research and the writing of a Distinguished Majors thesis.",
    "prerequisites": "CS 2150 or CS 2501 topic DSA2 with a grade of C- or higher, and BSCS major"
  },
  "CS_6316": {
    "description": "This is a graduate-level machine learning course. Machine Learning is concerned with computer programs that automatically improve their performance through experience. This course covers introductory topics about the theory and practical algorithms for machine learning from a variety of perspectives. Topics include supervised learning, unsupervised learning and learning theory.",
    "prerequisites": "Calculus, Basic linear algebra, Basic Probability and Basic Algorithm. Statistics is recommended. Students should already have good programming skills."
  },
  "CS_6456": {
    "description": "Covers advanced principles of operating systems. Technical topics include support for distributed OSs; microkernels and OS architectures; processes and threads; IPC; files servers; distributed shared memory; object-oriented OSs; reflection in OSs; real-time kernels; multiprocessing; multimedia and quality of service; mobile computing; and parallelism in I/O.",
    "prerequisites": "Undergraduate course in OS; CS 6354 or instructor permission."
  },
  "CS_6465": {
    "description": "Interactions between robots and humans are influenced by form, function and expectations. Quantitative techniques evaluate performance of specific tasks and functions. Qualitative techniques are used to evaluate the interaction and to understand expectations and perceptions of the human side of the interaction.  Students use humanoid robots to develop and evaluate interactions within a specific application context.",
    "prerequisites": ""
  },
  "CS_6501": {
    "description": "Course content varies by section and is selected to fill timely and special interests and needs of students. See CS 7501 for example topics. May be repeated for credit when topic varies.",
    "prerequisites": "Instructor permission."
  },
  "CS_6763": {
    "description": "Cyber-physical systems (CPS) are smart systems that include co-engineered interacting networks of physical and computational components. This course will teach students the required skills to analyze the CPS that are all around us, so that when they contribute to the design of CPS, they are able to understand important safety and security aspects and feel confident designing and analyzing CPS systems.",
    "prerequisites": ""
  },
  "CS_6888": {
    "description": "This course provides an overview of the state of the art in software analysis including static and dynamic analysis techniques and verification and validation. It explores the various ways that the analyses are used to predict software behavior.  The applications include inference, symbolic execution, fault localization, model checking, security and performance. The course combines theory with practical implementation and usage.",
    "prerequisites": "CS 3240."
  },
  "CS_6890": {
    "description": "A graduate student returning from Curricular Practical Training can use this course to claim one credit hour of academic credit after successfully reporting, orally and in writing, a summary of the CPT experience to his/her academic advisor.",
    "prerequisites": ""
  },
  "CS_6993": {
    "description": "Detailed study of graduate course material on an independent basis under the guidance of a faculty member.",
    "prerequisites": ""
  },
  "CS_7993": {
    "description": "Detailed study of graduate course material on an independent basis under the guidance of a faculty member.",
    "prerequisites": ""
  },
  "CS_7995": {
    "description": "Formal record of student commitment to project research for the Master of Computer Science degree under the guidance of a faculty advisor.",
    "prerequisites": ""
  },
  "CS_8897": {
    "description": "For master's students who are teaching assistants.",
    "prerequisites": ""
  },
  "CS_8999": {
    "description": "Formal record of student commitment to thesis research for the Master of Science degree under the guidance of a faculty advisor. May be repeated as necessary.",
    "prerequisites": ""
  },
  "CS_9897": {
    "description": "For doctoral students who are teaching assistants.",
    "prerequisites": ""
  },
  "CS_9999": {
    "description": "Formal record of student commitment to doctoral research under the guidance of a faculty advisor. May be repeated as necessary.",
    "prerequisites": ""
  },
  "STAT_1100": {
    "description": "This course studies introductory statistics and probability, visual methods for summarizing quantitative information, basic experimental design and sampling methods, ethics and experimentation, causation, and interpretation of statistical analyzes. Applications use data drawn from various current sources, including journals and news. No prior knowledge of statistics is required. Students will not receive credit for both STAT 1100 and STAT 1120.",
    "prerequisites": ""
  },
  "STAT_1601": {
    "description": "This course provides an introduction to the process of collecting, manipulating, exploring, analyzing, and displaying data using the statistical software R. The collection of elementary statistical analysis techniques introduced will be driven by questions derived from the data. The data used in this course will generally follow a common theme. No prior knowledge of statistics, data science, or programming is required.",
    "prerequisites": ""
  },
  "STAT_1602": {
    "description": "This course provides an introduction to various topics in data science using the Python programming language. The course will start with the basics of Python, and apply them to data cleaning, merging, transformation, and analytic methods drawn from data science analysis and statistics, with an emphasis on applications. No prior knowledge of statistics, data science, or programming is required.",
    "prerequisites": ""
  },
  "STAT_2020": {
    "description": "This course includes a basic treatment of probability, and covers inference for one and two populations, including both hypothesis testing and confidence intervals. Analysis of variance and linear regression are also covered. Applications are drawn from biology and medicine. No prior knowledge of statistics is required. Co-requisite: Concurrent enrollment in a lab section of STAT 2020.",
    "prerequisites": ""
  },
  "STAT_2120": {
    "description": "This course provides an introduction to the probability & statistical theory underlying the estimation of parameters & testing of statistical hypotheses, including those in the context of simple & multiple regression Applications are drawn from economics, business, & other fields. No prior knowledge of statistics is required. Highly Recommended: Prior experience with calculus I; Co-requisite: Concurrent enrollment in a lab section of STAT 2120.",
    "prerequisites": ""
  },
  "STAT_3080": {
    "description": "This course introduces methods to approach uncertainty and variation inherent in elementary statistical techniques from multiple angles. Simulation techniques such as the bootstrap will also be used. Conceptual discussion in lectures is supplemented with hands-on practice in applied data-analysis tasks using R.",
    "prerequisites": "A prior course in statistics and a prior course in programming."
  },
  "STAT_3110": {
    "description": "This course provides an overview of basic probability and matrix algebra required for statistics. Topics include sample spaces and events, properties of probability, conditional probability, discrete and continuous random variables, expected values, joint distributions, matrix arithmetic, matrix inverses, systems of linear equations, eigenspaces, and covariance and correlation matrices.",
    "prerequisites": "A prior course in calculus II."
  },
  "STAT_3120": {
    "description": "This course provides a calculus-based introduction to mathematical statistics with some applications. Topics include: sampling theory, point estimation, interval estimation, testing hypotheses, linear regression, correlation, analysis of variance, and categorical data.",
    "prerequisites": "A prior course in probability."
  },
  "STAT_3220": {
    "description": "This course provides a survey of regression analysis techniques, covering topics from simple regression, multiple regression, logistic regression, and analysis of variance. The primary focus is on model development and applications.",
    "prerequisites": "A prior course in statistics."
  },
  "STAT_3250": {
    "description": "This course provides an introduction to data analysis using the Python programming language. Topics include using an integrated development environment; data analysis packages numpy, pandas and scipy; data loading, storage, cleaning, merging, transformation, and aggregation; data plotting and visualization.",
    "prerequisites": "A prior course in statistics and a prior course in programming."
  },
  "STAT_3280": {
    "description": "This course introduces methods for presenting data graphically and in tabular form, including the use of software to create visualizations. Also introduced are databases, with topics including traditional relational databases and SQL (Structured Query Language) for retrieving information.",
    "prerequisites": "A prior course in statistics and a prior course in R programming."
  },
  "STAT_3480": {
    "description": "This course includes an overview of parametric vs. non-parametric methods including one-sample, two-sample, and k-sample methods; pair comparison and block designs; tests for trends and association; multivariate tests; analysis of censored data; bootstrap methods; multi-factor experiments; and smoothing methods.",
    "prerequisites": "A prior course in statistics."
  },
  "STAT_4120": {
    "description": "This course includes linear regression models, inferences in regression analysis, model validation, selection of independent variables, multicollinearity, influential observations, and other topics. Conceptual discussion is supplemented with hands-on practice in applied data-analysis tasks. Highly recommended: A prior course in applied regression such as STAT 3220.",
    "prerequisites": "A prior course in statistics and a prior course in linear algebra."
  },
  "STAT_4160": {
    "description": "This course introduces various topics in experimental design, including simple comparative experiments, single factor analysis of variance, randomized blocks, Latin squares, factorial designs, blocking and confounding, and two-level factorial designs. The statistical software R is used throughout this course.",
    "prerequisites": "A prior course in regression."
  },
  "STAT_4220": {
    "description": "This course focuses on applying data analytic techniques to business, including customer analytics, business analytics, and web analytics through mining of social media and other online data. Several projects are incorporated into the course.",
    "prerequisites": "A prior course in regression and a prior course in programming."
  },
  "STAT_4800": {
    "description": "This course provides a platform for exploring advanced statistical modeling and analysis techniques through the lens of state-of-the-art sports analytics.",
    "prerequisites": "A prior course in mathematical statistics, a prior course in regression, and a prior course in programming."
  },
  "STAT_4993": {
    "description": "Reading and study programs in areas of interest to individual students. For students interested in topics not covered in regular courses. Students must obtain a faculty advisor to approve and direct the program.",
    "prerequisites": ""
  },
  "STAT_4996": {
    "description": "Students will work in teams on a capstone project. The project will involve significant data preparation and analysis of data, preparation of a comprehensive project report, and presentation of results. Many projects will come from external clients who have data analysis challenges.",
    "prerequisites": "A prior course in regression and a prior course in programming. This course is restricted to Statistics majors in their final year."
  },
  "STAT_5180": {
    "description": "This course covers the main designs and estimation techniques used in sample surveys: simple random sampling, stratification, cluster sampling, double sampling, post-stratification, ratio estimation, and non response and other non sampling errors.  Conceptual discussion in lectures is supplemented with hands-on practice in applied data-analysis tasks using R statistical software.",
    "prerequisites": "STAT 3120."
  },
  "STAT_5630": {
    "description": "Introduces various topics in machine learning, including regression, classification, resampling methods, linear model selection and regularization, tree-based methods, support vector machines, and unsupervised learning.  The statistical software R is incorporated throughout.",
    "prerequisites": "STAT 5120, STAT 6120, or ECON 3720, and previous experience with R \nPrerequisite: STAT 5120, STAT 6120, or ECON 3720, and previous experience with R"
  },
  "STAT_5993": {
    "description": "Research into current statistical problems under faculty supervision.",
    "prerequisites": ""
  },
  "STAT_6021": {
    "description": "An introduction to linear statistical models in the context of data science. Topics include simple and multiple linear regression, generalized linear models, time series, analysis of covariance, tree-based classification, and principal components.  The primary software is R.",
    "prerequisites": "A previous statistics course, a previous linear algebra course, and permission of instructor."
  },
  "STAT_6130": {
    "description": "This course develops fundamental methodology to the analysis of multivariate data. Topics include the multivariate normal distributions, multivariate regression, multivariate analysis of variance (MANOVA), principal components analysis, factor analysis, and discriminant analysis. Conceptual discussion in lectures is supplemented with hands-on practice in applied data-analysis tasks using SAS or R statistical software.",
    "prerequisites": "Graduate standing in Statistics, or instructor permission."
  },
  "STAT_6160": {
    "description": "This course develops fundamental concepts and methodology in the design and analysis of experiments. Topics include analysis of variance, multiple comparison tests, completely randomized designs, the general linear model approach to ANOVA, randomized block designs, Latin square and related designs, completely randomized factorial designs with two or more treatments, hierarchical designs, split-plot and confounded factorial designs, and analysis of covariance. Conceptual discussion in lectures is supplemented with hands-on practice in applied data-analysis tasks using SAS or R statistical software.",
    "prerequisites": ""
  },
  "STAT_6620": {
    "description": "This course develops skills in reading the statistical research literature and prepares the student for contributing to it. Each student completes a well written and properly formatted paper that would be suitable for publication. The paper reviews literature relevant to a specialized research area, and possibly suggests an original research problem. Topics will vary from term to term.",
    "prerequisites": ""
  },
  "STAT_7100": {
    "description": "This course introduces fundamental concepts in the classical theory of statistical inference. Topics include sufficiency and related statistical principles, elementary decision theory, point estimation, hypothesis testing, likelihood-ratio tests, interval estimation, large-sample analysis, and elementary modeling applications.",
    "prerequisites": "STAT 6190 and graduate standing in Statistics"
  },
  "STAT_7620": {
    "description": "This course covers advanced theory and methodology in probability. It includes, but is not limited to, substantial, in-depth coverage of topics in stochastic processes. Context and additional topics vary by instructor.",
    "prerequisites": "STAT 7200"
  },
  "STAT_7995": {
    "description": "This course develops skills related to the practice of statistical consulting. It covers conceptual topics and provides experience with data analysis projects found in or resembling those in statistical practice. Conceptual discussion in lectures is supplemented with hands-on practice in applied data-analysis tasks using SAS or R statistical software.",
    "prerequisites": "Graduate standing in Statistics"
  },
  "STAT_9120": {
    "description": "Advanced graduate seminar in current research topics. Offerings in each semester are determined by student and faculty research interests.",
    "prerequisites": ""
  },
  "STAT_9998": {
    "description": "For doctoral research, taken before a dissertation director has been selected.",
    "prerequisites": ""
  },
  "STAT_9999": {
    "description": "For doctoral research, taken under the supervision of a dissertation director.",
    "prerequisites": ""
  },
  "MATH_1110": {
    "description": "Studies finite probability theory including combinatorics, equiprobable models, conditional probability and Bayes' theorem, expectation and variance, and Markov chains.",
    "prerequisites": ""
  },
  "MATH_1140": {
    "description": "The study of the mathematics needed to understand and answer a variety of questions that arise in everyday financial dealings. The emphasis is on applications, including simple and compound interest, valuation of bonds, amortization, sinking funds, and rates of return on investments. A solid understanding of algebra is assumed.",
    "prerequisites": ""
  },
  "MATH_1150": {
    "description": "Provides an activity and project-based exploration of informal geometry in two and three dimensions. Emphasizes visualization skill, fundamental geometric concepts, and the analysis of shapes and patterns. Topics include concepts of measurement, geometric analysis, transformations, similarity, tessellations, flat and curved spaces, and topology.",
    "prerequisites": ""
  },
  "MATH_1160": {
    "description": "Studies basic concepts, operations, and structures occurring in number systems, number theory, and algebra. Inquiry-based student investigations explore historical developments and conceptual transitions in the development of number and algebraic systems.",
    "prerequisites": ""
  },
  "MATH_1190": {
    "description": "A first calculus course for business/biology/social-science students. Topics include college algebra/limits and continuity/differentiation and integration of algebraic and elementary transcendental functions/applications to related-rates & optimization problems as well as to curve sketching & exponential growth. At most one of MATH 1190, MATH 1210, and 1310 may be taken for credit.",
    "prerequisites": "No previous exposure to Calculus."
  },
  "MATH_1210": {
    "description": "A first calculus course for business/biology/social-science students. Topics include limits and continuity/differentiation & integration of algebraic & elementary transcendental functions/applications to related-rates & optimization problems as well as to curve sketching & exponential growth. At most one of MATH 1190, MATH 1210, and MATH 1310 may be taken for credit.",
    "prerequisites": ""
  },
  "MATH_1220": {
    "description": "A second calculus course for business/biology/and social-science students. Topics include differential equations/infinite series/analysis of functions of several variables/analysis of probability density functions of continuous random variables. The course begins with a review of basic single-variable calculus.",
    "prerequisites": "MATH 1210 or equivalent; at most one of MATH 1220 and MATH 1320 may be taken for credit."
  },
  "MATH_1310": {
    "description": "A first calculus course for natural-science majors/students planning further work in mathematics/students intending to pursue graduate work in applied social sciences. Introduces differential & integral calculus for single-variable functions, emphasizing techniques/applications & major theorems, like the fundamental theorem of calculus.",
    "prerequisites": "Background in algebra/trigonometry/exponentials/logarithms/analytic geometry."
  },
  "MATH_1320": {
    "description": "A second calculus course for natural-science majors, students planning additional work in mathematics, and students intending to pursue graduate work in the applied social sciences.  Topics include applications of the integral, techniques of integration, differential equations, infinite series, parametric equations, and polar coordinates.",
    "prerequisites": "MATH 1310 or equivalent; at most one of MATH 1220 and MATH 1320 may be taken for credit."
  },
  "MATH_2310": {
    "description": "A continuation of Calc I and II, this course is about functions of several variables. Topics include finding maxima and minima of functions of several variables/surfaces and curves in three-dimensional space/integration over these surfaces and curves. Additional topics: conservative vector fields/Stokes' and the divergence theorems/how these concepts relate to real world applications.",
    "prerequisites": "MATH 1320 or the equivalent."
  },
  "MATH_3000": {
    "description": "Covers basic concepts with an emphasis on writing mathematical proofs.  Topics include logic, sets, functions and relations, equivalence relations and partitions, induction, and cardinality.",
    "prerequisites": "Math 1320; and students with a grade of B or better in Math 3310, 3354, or any 5000-level Math course are not eligible to enroll in Math 3000."
  },
  "MATH_3100": {
    "description": "Introduces fundamental ideas of probability, the theory of randomness. Focuses on problem solving and understanding key theoretical ideas. Topics include sample spaces, counting, random variables, classical distributions, expectation, Chebyshev's inequality, independence, central limit theorem, conditional probability, generating functions, joint distributions.",
    "prerequisites": "MATH 1320 or equivalent. Strongly recommended: MATH 2310"
  },
  "MATH_3250": {
    "description": "Introduces the methods, theory, and applications of differential equations. Includes first-order, second and higher-order linear equations, series solutions, linear systems of first-order differential equations, and the associated matrix theory. May include numerical methods, non-linear systems, boundary value problems, and additional applications.",
    "prerequisites": "MATH 1320 or its equivalent."
  },
  "MATH_3310": {
    "description": "A rigorous development of the properties of the real numbers and the ideas of calculus including theorems on limits, continuity, differentiability, convergence of infinite series, and the construction of the Riemann integral. Students without prior experience constructing rigorous proofs are encouraged to take Math 3000 before or concurrently with Math 3310.",
    "prerequisites": "MATH 1320."
  },
  "MATH_3315": {
    "description": "This course is a continuation of MATH 2315. Covers topics from linear algebra/differential equations/real analysis. Success in this course and MATH 2315 (grades of B- or higher) exempts the student from the math major requirement of taking MATH 3351 and MATH 3250.  Students are encouraged to take more advanced courses in these areas.",
    "prerequisites": "MATH 2315."
  },
  "MATH_3340": {
    "description": "Covers functions of a complex variable that are complex differentiable and the unusual and useful properties of such functions. Some topics: Cauchy's integral formula/power series/the residue theorem/Rouché's theorem. Applications include doing real integrals using complex methods and applications to fluid flow in two dimensions.",
    "prerequisites": "MATH 2310."
  },
  "MATH_3350": {
    "description": "Topics will include systems of linear equations, matrix operations and inverses, vector spaces and subspaces, determinants, eigenvalues and eigenvectors, matrix factorizations, inner products and orthogonality, and linear transformations.  Emphasis will be on applications, with computer software integrated throughout the course.  The target audience for MATH 3350 is non-math majors from disciplines that apply tools from linear algebra. Credit is not given for both MATH 3350 and 3351.",
    "prerequisites": ""
  },
  "MATH_3351": {
    "description": "Includes matrices, elementary row operations, inverses, vector spaces and bases, inner products and Gram-Schmidt orthogonalization, orthogonal matrices, linear transformations and change of basis, eigenvalues, eigenvectors, and symmetric matrices. Emphasis will be on the theory of the subject and abstract arguments. Credit is not given for both MATH 3350 and 3351.",
    "prerequisites": "MATH 1320."
  },
  "MATH_3354": {
    "description": "Surveys major topics of modern algebra: groups, rings, and fields. Presents applications to areas such as geometry and number theory; explores rational, real, and complex number systems, and the algebra of polynomials.  Students without prior experience constructing rigorous proofs are encouraged to take Math 3000 before or concurrently with Math 3354.",
    "prerequisites": "MATH 1320."
  },
  "MATH_4110": {
    "description": "Topics in probability selected from Random walks, Markov processes, Brownian motion, Poisson processes, branching processes, stationary time series, linear filtering and prediction, queuing processes, and renewal theory.",
    "prerequisites": "MATH 3100 and MATH 3351."
  },
  "MATH_4140": {
    "description": "This class introduces students to the mathematics used in pricing derivative securities. Topics include a review of the relevant probability theory of conditional expectation and martingales/the elements of financial markets and derivatives/pricing contingent claims in the binomial & the finite market model/(time permitting) the Black-Scholes model.",
    "prerequisites": "MATH 3100, MATH 3351 and a proof-based course (MATH 3000, MATH 3310 or MATH 3354)."
  },
  "MATH_4250": {
    "description": "A second course in ordinary differential equations, from the dynamical systems point of view. Topics include: existence and uniqueness theorems; linear systems; qualitative study of equilibria and attractors; bifurcation theory; introduction to chaotic systems. Further topics as chosen by the instructor. Applications drawn from physics, biology, and engineering.",
    "prerequisites": "MATH 3351 or APMA 3080 and MATH 3310 or MATH 4310."
  },
  "MATH_4300": {
    "description": "Includes Taylor's theorem, solution of nonlinear equations, interpolation and approximation by polynomials, numerical quadrature. May also cover numerical solutions of ordinary differential equations, Fourier series, or least-square approximation.",
    "prerequisites": "MATH 3250 and computer proficiency."
  },
  "MATH_4330": {
    "description": "Differential and integral calculus in Euclidean spaces.  Implicit and inverse function theorems, differential forms and Stokes' theorem.",
    "prerequisites": "multivariable calculus, basic real analysis, linear algebra and  one of the following: MATH 4310, MATH 4651, MATH 4770, MATH 3315, or instructor  permission."
  },
  "MATH_4559": {
    "description": "This course provides the opportunity to offer a new topic in the subject of mathematics.",
    "prerequisites": ""
  },
  "MATH_4651": {
    "description": "Review of topics from Math 3351: vector spaces, bases, dimension, matrices and linear transformations, diagonalization; however, the material is covered in greater depth and generality. The course continues with more advanced topics including Jordan canonical forms and introduction to bilinear forms.",
    "prerequisites": "a proof-based course and familiarity with computational aspects of elementary linear algebra. Math 3354 is strongly recommended"
  },
  "MATH_4652": {
    "description": "Structural properties of basic algebraic systems such as groups, rings, and fields. A special emphasis is made on polynomials in one and several variables, including irreducible polynomials, unique factorization, and symmetric polynomials. Time permitting such topics as group representations or algebras over a field may be included.",
    "prerequisites": "MATH 3351 or 4651 and MATH 3354 or permission of the instructor."
  },
  "MATH_4840": {
    "description": "This course will introduce students to the techniques and methods of mathematical research. Students  will independently work with mathematical literature on a topic assigned by the instructor and present their findings in various formats (presentation, paper etc.).",
    "prerequisites": ""
  },
  "MATH_4901": {
    "description": "This is the second semester of a two semester sequence for the purpose of the completion of a Distinguished Major Thesis. A faculty member guides the student through all phases of the process which culminates in an open presentation of the thesis to an audience including a faculty evaluation committee.",
    "prerequisites": "MATH 4900."
  },
  "MATH_4993": {
    "description": "Reading and study programs in areas of interest to individual students. For third- and fourth-years interested in topics not covered in regular courses. Students must obtain a faculty advisor to approve and direct the program.",
    "prerequisites": ""
  },
  "MATH_5700": {
    "description": "Topics selected from analytic, affine, projective, hyperbolic, and non-Euclidean geometry.",
    "prerequisites": "MATH 2310, 3351, or instructor permission."
  },
  "MATH_5896": {
    "description": "A rigorous program of supervised study designed to expose the student to a particular area of mathematics.",
    "prerequisites": "Instructor permission and graduate standing."
  },
  "MATH_7010": {
    "description": "This seminar discusses the issues related to research in Mathematics. There are speakers from the different areas of mathematics represented at the University of Virginia. Credit may not be used towards a Master's degree.",
    "prerequisites": "Graduate standing in mathematics."
  },
  "MATH_7310": {
    "description": "Introduces measure and integration theory.",
    "prerequisites": "MATH 5310 or equivalent."
  },
  "MATH_7752": {
    "description": "Studies groups, rings, fields, modules, tensor products, and multilinear functions.",
    "prerequisites": "MATH 5651, 5652, or equivalent."
  },
  "MATH_7754": {
    "description": "Further topics in algebra.",
    "prerequisites": ""
  },
  "MATH_7800": {
    "description": "Topics include the fundamental group, covering spaces, covering transformations, the universal covering spaces, graphs and subgroups of free groups, and the fundamental groups of surfaces. Additional topics will be from homology, including chain complexes, simplicial and singular homology, exact sequences and excision, cellular homology, and classical applications.",
    "prerequisites": "MATH 5352, 5770, or equivalent."
  },
  "MATH_7830": {
    "description": "Examines fiber bundles; induced bundles, principal bundles, classifying spaces, vector bundles, and characteristic classes, and introduces K-theory and Bott periodicity.",
    "prerequisites": "MATH 7800."
  },
  "MATH_8310": {
    "description": "Topics in the theory of operators on a Hilbert space and related areas of function theory.",
    "prerequisites": ""
  },
  "MATH_8360": {
    "description": "This course presents the basic theory of stochastic differential equations and provides examples of its applications.  It is an essential topic for students preparing to do research in probability. Topics covered include a review of the relevant stochastic process and martingale theory; stochastic calculus including Ito's formula; existence and uniqueness for stochastic differential equations, strong Markov property; and applications.",
    "prerequisites": "MATH 7360 and 7370, or instructor permission."
  },
  "MATH_8380": {
    "description": "Discusses fundamental problems and results of the theory of random matrices, and their connections to tools of algebra and combinatorics: Wigner's semicircle law, free probability, Gaussian, circular, and beta ensembles of random matrices, bulk and edge asymptotics and universality, Dyson's Brownian motion, determinantal point processes, and discrete analogues of random matrix models.",
    "prerequisites": "MATH 7360 or instructor permission."
  },
  "MATH_8620": {
    "description": "Studies the foundations of algebraic geometry.",
    "prerequisites": ""
  },
  "MATH_8750": {
    "description": "Studies regular and critical values, gradient flow, handle decompositions, Morse theory, h-cobordism theorem, Dehn's lemma in dimension 3, and disk theorem in dimension 4.",
    "prerequisites": "Math 5770."
  },
  "MATH_8851": {
    "description": "Studies the basic structure theory of groups, especially finite groups.",
    "prerequisites": ""
  },
  "MATH_9010": {
    "description": "Discusses topics from number theory.",
    "prerequisites": ""
  },
  "MATH_9250": {
    "description": "Harmonic Analysis and PDEs seminar",
    "prerequisites": ""
  },
  "MATH_9310": {
    "description": "Operator Theory Seminar",
    "prerequisites": ""
  },
  "MATH_9410": {
    "description": "Galois-Grothendieck Seminar",
    "prerequisites": ""
  },
  "MATH_9450": {
    "description": "Mathematical Physics Seminar",
    "prerequisites": ""
  },
  "MATH_9820": {
    "description": "Discusses subjects from geometry and topology.",
    "prerequisites": ""
  },
  "MATH_9950": {
    "description": "Algebra Seminar",
    "prerequisites": ""
  },
  "MATH_9995": {
    "description": "Independent Research",
    "prerequisites": ""
  },
  "MATH_9998": {
    "description": "For doctoral research, taken before a dissertation director has been selected.",
    "prerequisites": ""
  },
  "MATH_9999": {
    "description": "The Mathematics Colloquium is held weekly, the sessions being devoted to research activities of students and faculty members, and to reports by visiting mathematicians on current work of interest. For doctoral dissertation, taken under the supervision of a dissertation director.",
    "prerequisites": ""
  },
  "STS_2050": {
    "description": "This course investigates a major source of human impact upon the Earth - energy consumption to fuel human activity. The course a) provides a cross-disciplinary perspective on the challenge of human-centered energy use, b) explains the historical origins of today's energy systems, c) describes current energy systems, d) examines the components of sustainable energy systems, and e) considers keys to their deployment.",
    "prerequisites": ""
  },
  "STS_2600": {
    "description": "The mission of UVA - SEAS is \"to make the world a better place by creating and disseminating knowledge and by preparing engineering leaders to solve global challenges.\" In alignment with that mission, this course seeks to equip undergraduates with knowledge, understanding, and practice to prepare them for ethical leadership now, as students, and for their future as engineering leaders. Prerequisite 2nd, 3rd, or 4th year Engineering student",
    "prerequisites": ""
  },
  "STS_2620": {
    "description": "Examines the development of public policies aimed at promoting and regulating science and technology. Topics include historical evolution of the federal government's involvement in science policy; the players, organizations, and agencies who make science policy; the reasons the government funds the research it does; how science and technology is regulated by the government.",
    "prerequisites": ""
  },
  "STS_2993": {
    "description": "Special tutorial with a topic declared in advance. Limited to undergraduate SEAS students with third- or fourth-year standing.  Not to substitute for STS 4500, 4600. The topic, work plan, and conditions are arranged by contract between instructor and student and approved by the department chair, with a copy to be filed in the department office. Admittance at the discretion of the professor.",
    "prerequisites": ""
  },
  "STS_3020": {
    "description": "This Socratic course prepares undergrads for internships in science, engineering and technology (SET) in Washington, DC. A core objective is to increase knowledge, oral and written skills for assessing SET and their impacts on public policy. Engineering students accepted into the SEAS Policy Internship Program in Science and Technology must take the course. Students from Batten School, the College and other schools are also welcome to enroll.",
    "prerequisites": ""
  },
  "STS_3300": {
    "description": "Development of knowledge and skills needed to conduct qualitative research. Grounded in science and technology studies (STS), feminism, anthropology, and ethnic studies, students will engage questions of authority, representation, critical consciousness, and power. Lays the intellectual groundwork for students to use research methods as tools for catalyzing reflexivity in scientific and technological disciplines.",
    "prerequisites": "STS 2101 or receive permission from the instructor."
  },
  "STS_4500": {
    "description": "This course engages students with the idea that success in posing and solving engineering problems requires attention to the social dimensions of professional endeavors and practice. STS theories and methods are applied to student thesis projects. Students produce a prospectus for the undregraduate thesis project. Students must be in residence to take this course. Students are not permitted to take STS 4500 and STS 4600 simultaneously. Prereq: STS 2600 and STS 2000 or STS 3000 level (or writing requirement equivalent) course. 4th Year Engineering or by instructor permission for early graduation.",
    "prerequisites": ""
  },
  "STS_4600": {
    "description": "This course focuses on ethical issues in engineering. The key theme is that ethics is central to engineering practice. The professional responsibilities of engineers are examined. Students produce an STS Research paper linked to their technical thesis project and complete all of the requirements for the undergraduate thesis. Students must be in residence to take this course. Students are not permitted to take STS 4500 and STS 4600 simultaneously.",
    "prerequisites": "STS 4500."
  },
  "CS_1501": {
    "description": "Student led special topic courses which vary by semester.",
    "prerequisites": ""
  },
  "CS_4770": {
    "description": "This course explores Natural Language Processing (NLP), examining how computers are trained to understand and process human language. Students will gain a thorough understanding of both core NLP concepts and advanced techniques, including text analysis, language modeling, machine translation, question answering, text generation, conversation modeling, and the latest advancements in large language models.",
    "prerequisites": "CS 3100 with a grade of a C- or better and APMA 3080 or equivalent."
  },
  "CS_4771": {
    "description": "This course aims to give an introduction to basic ideas and concepts of RL while avoiding deep dive in mathematical treatments. The course will help the student build an intuitive understanding of RL and give students hands-on experience on small-scale RL problems.",
    "prerequisites": "CS 2100 with a grade of C- or better or successfully complete the CS 2100 place out test."
  },
  "CS_4971": {
    "description": "This course is one option in the CS fourth-year thesis track and is the continuation from CS 4970. Under the practicum track, students will take two 3-credit courses, CS 4970 and CS 4971. These courses would form a year-long group-based and project-based practicum class. There would be an actual customer, which could be either internal (the course instructor, other CS professors, etc.) or external (local companies, local non-profits, etc.).",
    "prerequisites": "CS 4970"
  },
  "CS_6770": {
    "description": "This course explores Natural Language Processing (NLP), examining how computers are trained to understand and process human language. Students will gain a thorough understanding of both core NLP concepts and advanced techniques, including text analysis, language modeling, machine translation, question answering, text generation, conversation modeling, and the latest advancements in large language models.",
    "prerequisites": ""
  },
  "CS_6771": {
    "description": "This course focuses on the core principles of RL. Like statistical learning, a central challenge of RL is to generalize learned capabilities to unseen environments. However, RL faces additional challenges such as exploration-exploitation tradeoff, credit assignment, and distribution mismatch between behavior and target policies. Throughout the course, we will delve into various solutions to these challenges and provide theoretical justifications.",
    "prerequisites": ""
  },
  "STAT_3559": {
    "description": "This course provides the opportunity to offer a new topic in the subject area of Statistics.",
    "prerequisites": ""
  },
  "STAT_5310": {
    "description": "Studies experimental designs for randomized clinical trials, sources of bias in clinical studies, informed consent, logistics, and interim monitoring procedures (group sequential and Bayesian methods).",
    "prerequisites": "A basic statistics course (MATH 3120/5100) or instructor permission."
  },
  "STAT_6260": {
    "description": "This course develops fundamental methodology to the analysis of categorical data. Topics include contingency tables, generalized linear models, logistic regression, and logit and loglinear models. Conceptual discussion in lectures is supplemented with hands-on practice in applied data-analysis tasks using SAS or R statistical software.",
    "prerequisites": "Graduate standing in Statistics, or instructor permission."
  },
  "STAT_7610": {
    "description": "This course covers advanced theory and methodology in statistical inference. It includes, but is not limited to, substantial, in-depth coverage of topics in asymptotic inference. Context and additional topics vary by instructor.",
    "prerequisites": ""
  },
  "MATH_5080": {
    "description": "Development of mathematical models and their solutions, including linear programming, the simplex algorithm, dual programming, parametric programming, integer programming, transportation models, assignment models, and network analysis.",
    "prerequisites": "MATH 1320, 3351 and a proof-based course (3000, 3310 or 3354)."
  },
  "MATH_7070": {
    "description": "Covers topics in first order logic and model theory.",
    "prerequisites": ""
  },
  "MATH_7600": {
    "description": "Examines categories, functors, abelian catqegories, limits and colimits, chain complexes, homology and cohomology, homological dimension, derived functors, Tor and Ext, group homology, Lie algebra homology, spectral sequences, and calculations.",
    "prerequisites": "MATH 5770."
  },
  "MATH_8630": {
    "description": "Theory of number fields and local fields, ramification theory, further topics as chosen by instructor.",
    "prerequisites": ""
  },
  "MATH_8850": {
    "description": "Selected advanced topics in algebraic topology.",
    "prerequisites": ""
  },
  "STS_3500": {
    "description": "Specific topics vary. Advanced level examination of the relationships among science, technology and society.",
    "prerequisites": ""
  },
  "DS_1001": {
    "description": "Exposes students to the emerging field of Data Science, its domain areas, and popular applications. Topics include analytical methods, ethical issues associated with the field, engineering, and systems necessary to support data-related work, and design principles commonly seen in data communications and human center design. Students learn from leaders in the field through a series of guest lectures and work through discussion examples.",
    "prerequisites": ""
  },
  "DS_1002": {
    "description": "Will expose student to fundamental coding languages in data science. Python and R will be the primary focus of the course. Popular packages such as pandas and tidyverse will be covered in depth. Additionally, project management skills such as Git and Github will be covered.",
    "prerequisites": ""
  },
  "DS_2002": {
    "description": "This course will center on exposing students to contemporary pipelines for data analysis through a series of steadily escalating use cases.  The course will begin with simple local database construction such as SQLite and evolve to cloud base systems such as AWS or Google Cloud. This progression will include topics such as data lakes and other non-SQL applications as appropriate.",
    "prerequisites": ""
  },
  "DS_2003": {
    "description": "The course is designed to not only teach students tools necessary to visualize data but also effective techniques for explaining data driven results with an emphasis on communicating statistical output in a manner that best represents the findings. Examples might include tailoring messages based on the audience or shaping visualizations to follow a story-line. Content on the development of interactive plots and dashboards will also be included.",
    "prerequisites": ""
  },
  "DS_2004": {
    "description": "Explores principles and applications of data ethics within a broader social framework that prioritizes conversations about policy, regulatory frameworks, accountability, transparency, and governance models. Will discuss who is responsible for doing responsible data science, question how our work shapes the world around us, and understand the impacts of big data on people and communities.",
    "prerequisites": ""
  },
  "DS_2024": {
    "description": "Explores principles and applications of data ethics within a broader social framework. Works to lay foundational knowledge for more advanced courses in the Value domain of the major. Will discuss who is responsible for doing responsible data science, question how our work shapes the world around us, and understand the impacts of big data on people and communities.",
    "prerequisites": ""
  },
  "DS_3001": {
    "description": "This course exposes students to foundational knowledge in each of the four high level domain areas of data science (Value, Design, Analytics, Systems). This includes an emphasis on ethical issues surrounding the field of data science and how these issues originate and extend into society more broadly.",
    "prerequisites": ""
  },
  "DS_3021": {
    "description": "Exposes students to foundational knowledge in the area of analytics, especially as it relates to machine learning. The focus is on methods needed to prepare data for machine learning models, how to evaluate the output of ML models and engineering features.",
    "prerequisites": ""
  },
  "DS_3025": {
    "description": "Engage with and train in the use of key concepts in machine learning and math: OLS estimator for regression; logistic regression & maximum likelihood estimator; multiple linear regression; principal components analysis & multiple correspondence analysis; neural networks; logarithms; probability distributions; integrals; multivariate optimization; matrix notation, eigen-math, and matrix decomposition; infinite power series & Taylor series.",
    "prerequisites": ""
  },
  "DS_3026": {
    "description": "Explore mathematical foundations of inferential and prediction frameworks, with emphasis on computation, used to learn from data. Frequentist, Bayesian, and Likelihood viewpoints are all considered. Topics: principles of estimation, optimality, bias, variance, consistency, sampling distributions, estimating equations, information, bootstrap methods, ROC curves, shrinkage, large sample theory, prediction optimality versus estimation optimality.",
    "prerequisites": ""
  },
  "DS_4002": {
    "description": "The data science project course will allow students to take the knowledge gained in each of the four required courses and apply them to a data driven problem. Students will work in groups and can either choose a project provided by SDS faculty or can propose a project for approval. Upon completion of the course students will be required to present their results and publish project content to an open forum.",
    "prerequisites": ""
  },
  "DS_4023": {
    "description": "Principles of interactivity in application and dashboard development using R, Python, and JavaScript programming languages. Design visually appealing and user-friendly interfaces, develop interactive applications for data visualization, and build dynamic dashboards for effective data communication with end-users. Covers theoretical concepts and hands-on implementation to provide a comprehensive understanding of the full design process.",
    "prerequisites": ""
  },
  "DS_4024": {
    "description": "Explainable artificial intelligence (XAI) is a subfield of machine learning that provides transparency for complex models to connect the technical meaning to social interpretation. Explore interpretability, transparency, and black-box machine learning methods. Covers definitions, decision support, trust, and ethical considerations, and the latest advances in creating reliable and transparent AI models.",
    "prerequisites": ""
  },
  "DS_4125": {
    "description": "Understand Deep Learning covering neural networks, activation functions, and optimization algorithms. Gain experience with TensorFlow and PyTorch, mastering key techniques such as Convolutional Neural Networks (CNNs), Recurrent Neural Networks (RNNs), and Generative Adversarial Networks (GANs). Explore transfer learning, reinforcement learning, and natural language processing (NLP), along with industry applications and ethical considerations.",
    "prerequisites": ""
  },
  "DS_4320": {
    "description": "Comprehensive exploration of the multifaceted aspects of data creation, emphasizing the symbiotic relationship between design and data. Students will gain insight into the intentional and unintentional mechanisms that contribute to data creation, including human input, technological processes, environmental factors, and systemic influences.",
    "prerequisites": ""
  },
  "DS_4993": {
    "description": "Reading and research under the direction of a faculty member. Students must obtain approval from a faculty advisor to approve and direct the independent study. Final approval by the Director of Undergraduate Programs is also required.",
    "prerequisites": ""
  },
  "DS_5001": {
    "description": "Covers foundations and applications of NLP with a focus on the most popular form of unstructured data ¿ text. Convert source texts into structure-preserving analytical form and then apply information theory, NLP tools, and vector-based methods to explore language models, topic models, sentiment analyses, and GenAI techniques. Focus is on unsupervised methods to explore cognitive patterns in texts, with real-world examples and demonstrations.",
    "prerequisites": ""
  },
  "DS_5003": {
    "description": "Provides healthcare domain knowledge, healthcare data understanding, and data science methodologies to solve problems. Understand data types, models, and sources, including electronic health record data; health outcomes, quality, risk, and safety data; and unstructured data, such as clinical text data; biomedical sensor data; and biomedical image data. Querying with SQL, data visualization with Tableau, and analysis and prediction with Python.",
    "prerequisites": ""
  },
  "DS_5007": {
    "description": "This course looks into the past, present, and future of technologies that impact labor, with an eye to empowering students with knowledge about the social, economic, and political dimensions of the tools they use both inside and outside of work. The course covers labor history, whistleblowers, and hidden histories of common technologies that reorient common assumptions about what technologies can do, and what they have done in the past.",
    "prerequisites": ""
  },
  "DS_5012": {
    "description": "Provides a foundation in discrete mathematics, data structures, algorithmic design and implementation, computational complexity, parallel computing, and data integrity and consistency. Case studies and exercises will be drawn from real-world examples (e.g., bioinformatics, public health, marketing, and security).",
    "prerequisites": ""
  },
  "DS_5023": {
    "description": "Principles of interactivity in application and dashboard development using R, Python, and JavaScript programming languages. Design visually appealing and user-friendly interfaces, develop interactive applications for data visualization, and build dynamic dashboards for effective data communication with end-users. Covers theoretical concepts and hands-on implementation to provide a comprehensive understanding of the full design process at the graduate level.",
    "prerequisites": ""
  },
  "DS_5030": {
    "description": "Provides an in-depth exploration of probabilistic and statistical methods used to understand, quantify, and manage uncertainty. Learn foundational concepts in probability and statistics, simulation techniques, and modern approaches to parameter estimation, decision theory, and hypothesis testing. Topics include parametric and nonparametric methods, Bayesian and frequentist paradigms, and applications of uncertainty in real-world problems.",
    "prerequisites": ""
  },
  "DS_5070": {
    "description": "This course will equip students with some of the most commonly used deep learning architectures. We will explore feed-forward networks, convolutional neural networks, UNETs, encoders-decoders, generative adversarial networks and transformers. We will also analyze tools of explainable AI. Focused on environmental applications, students will apply these techniques to real-world data, solving problems in prediction, pattern recognition, and data-driven insights. Solid background in probability, statistics, and in coding (preferably Python) is recommended for enrollment in this course.",
    "prerequisites": ""
  },
  "DS_5220": {
    "description": "An intensive overview of cloud infrastructure and their role in data science. Topics will include storage as a service, ephemeral computing resources, auto-scaling, and event-driven workloads. Special attention will be paid to cloud-native design patterns, which are built assuming the unique functionality of cloud computing resources.",
    "prerequisites": ""
  },
  "DS_6001": {
    "description": "Covers the practice of data science, including communication, exploratory data analysis, and visualization. Also covered are the selection of algorithms to suit the problem to be solved, user needs, and data. Case studies will explore the impact of data science across different domains.",
    "prerequisites": ""
  },
  "DS_6002": {
    "description": "This course examines the ethical issues arising around big data and provides frameworks, context, concepts, and theories to help students think through and deal with the issues as they encounter them in their professional lives.",
    "prerequisites": ""
  },
  "DS_6015": {
    "description": "Designed for capstone project teams to meet in groups with advisors and clients to advance work on their projects. Capstone course for MSDS Online students.",
    "prerequisites": ""
  },
  "DS_6021": {
    "description": "Comprehensive introduction to predictive modeling, a cornerstone of data science and machine learning. Learn the fundamental concepts, techniques, and tools used to build models while emphasizing both theoretical understanding and practical applications. The topics include we will cover are an in-depth analysis of linear models and different variants, their extension to generalized linear models, and an introduction to nonparametric regression.",
    "prerequisites": ""
  },
  "DS_6030": {
    "description": "This course covers fundamentals of data mining and machine learning within a common statistical framework. Topics include regression, classification, clustering, resampling, regularization, tree-based methods, ensembles, boosting, and Support Vector Machines. Coursework is conducted in the R programming language.",
    "prerequisites": ""
  },
  "DS_6050": {
    "description": "A graduate-level course on deep learning fundamentals and applications with emphasis on their broad applicability to problems across a range of disciplines. Topics include regularization, optimization, convolutional networks, sequence modeling, generative learning, instance-based learning, and deep reinforcement learning. Students will complete several substantive programming assignments. A course covering statistical techniques such as regression.",
    "prerequisites": ""
  },
  "DS_6210": {
    "description": "Many problems in data science essentially boil down to some mathematical relationships that are to be solved numerically. But have you ever wondered how computers could do math? This graduate-level data science course aims to cover fundamental topics of scientific computing, specifically selected and curated for data scientists, including numerical errors, root finding algorithms, numerical linear algebra, and numerical optimization.",
    "prerequisites": ""
  },
  "DS_6310": {
    "description": "Explores the mathematical foundations of inferential and prediction frameworks commonly used to learn from data. Frequentist, Bayesian, Likelihood viewpoints are considered. Topics include: principles of estimation, optimality, bias, variance, consistency, sampling distributions, estimating equations, information, Bootstrap methods, ROC curves, shrinkage, and some large-sample theory, prediction optimality versus estimation optimality.",
    "prerequisites": ""
  },
  "DS_6404": {
    "description": "Introduces physics-aware deep learning (PADL), an emerging approach that embeds physical laws into neural networks for accurate, efficient modeling. Topics include differential equations, physics-informed neural networks, neural operators, and PyTorch implementation. Students gain both theoretical foundations and practical skills to apply PADL across disciplines.",
    "prerequisites": ""
  },
  "DS_6410": {
    "description": "Fundamentals of data mining and machine learning within a common statistical framework. Topics include boosting, ensembles, Support Vector Machines, model-based clustering, forecasting, neural networks, recommender systems, market basket analysis, and network centrality.",
    "prerequisites": ""
  },
  "DS_6700": {
    "description": "Combines topics in data ethics, critical data studies, public policy, governance, and regulation. Address challenges by topic (Health, Education, Culture & Entertainment, Security & Defense, Cities, Environment, Labor). Research how data-centric systems are deployed within socioeconomic ecosystems and shape the world. Interrogate connections between data science, governments, industry, civil society organizations, and communities.",
    "prerequisites": ""
  },
  "DS_6993": {
    "description": "Specialized or advanced topics not in DS current course offerings. Requires (a) approval of the program director and (b) an SDS faculty member who will serve as instructor.  Propose a syllabus which includes a week-by-week accounting of the topics, materials (papers and textbooks), and assessments.  Reach out to the program director for more details.",
    "prerequisites": ""
  },
  "DS_7600": {
    "description": "This graduate-level course explores the principles, methodologies, and applications of human-centered design (HCD). Students will learn how to create solutions that meet real human needs. The course combines theoretical foundations with practical application through hands-on projects where students will define problems, prototype solutions, and test with users to develop impactful, user-centered products and services.",
    "prerequisites": ""
  },
  "DS_8104": {
    "description": "Networks provide a unifying framework to study the structure hidden within complex data. This graduate-level course focuses on the fundamental concepts and statistics as well as recent advancements and applications of network science. Topics include: graph theory, structural paradoxes, measures and algorithms for quantifying importance, community detection, network inference, recommendation systems, and link prediction.",
    "prerequisites": ""
  },
  "DS_8998": {
    "description": "Engages students in identification of a research question, a review of the literature and the application of an existing data science tool or technique (algorithm) to that problem. This is a mentored experience and will allow the student to demonstrate their capacity for research and begin to develop a relationship with a faculty mentor in Data Science. Course requires instructor permission.",
    "prerequisites": ""
  },
  "DS_9999": {
    "description": "PhD level Dissertation Research.",
    "prerequisites": ""
  }
}